In [1]:
import pandas as pd
import numpy as np

默认指定索引

In [2]:
a1 = pd.Series([1,2,3,4])
print(a1)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
import pandas as pd
import numpy as np

In [4]:
a1.values

array([1, 2, 3, 4], dtype=int64)

In [5]:
a1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
a2 = pd.Series([1,2,3,5,6,7,8],index=['a','s','d','f','g','h','j'])
a2

a    1
s    2
d    3
f    5
g    6
h    7
j    8
dtype: int64

In [7]:
a2['a']

1

In [8]:
a2[['a','f','g']]

a    1
f    5
g    6
dtype: int64

In [9]:
3 in a2

False

In [10]:
a2

a    1
s    2
d    3
f    5
g    6
h    7
j    8
dtype: int64

In [11]:
5 in a2

False

In [12]:
'f' in a2

True

In [13]:
dict = {'apple':14,'pen':3,'bannana':6}
s3 = pd.Series(dict)
print(s3)

apple      14
pen         3
bannana     6
dtype: int64

In [14]:
data = {'year':[2014,2015,2016,2017],
       'incom':[10000,20000,30000,40000],
       'pay':[5000,15000,25000,35000]}
df1 = pd.DataFrame(data)
df1

   year  incom    pay
0  2014  10000   5000
1  2015  20000  15000
2  2016  30000  25000
3  2017  40000  35000

In [15]:
df2 = pd.DataFrame(np.arange(12).reshape((3,4)))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [16]:
df3 = pd.DataFrame(np.arange(12).reshape(3,4),index=['a','b','c'],columns=[1,2,3,4])
df3

   1  2   3   4
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

# DataFrame基本属性

In [17]:
df3.columns

Int64Index([1, 2, 3, 4], dtype='int64')

In [18]:
df3.index

Index(['a', 'b', 'c'], dtype='object')

In [19]:
df3.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [20]:
df3.describe()

         1    2     3     4
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

In [21]:
df3.T

   a  b   c
1  0  4   8
2  1  5   9
3  2  6  10
4  3  7  11

In [22]:
df4 = pd.DataFrame(np.arange(12,0,-1).reshape(3,4),index=['c','b','a'],columns=[2,1,4,3])
df4

    2   1   4  3
c  12  11  10  9
b   8   7   6  5
a   4   3   2  1

In [23]:
df4.sort_index(axis=0)#按列的索引大小排序

    2   1   4  3
a   4   3   2  1
b   8   7   6  5
c  12  11  10  9

In [24]:
df4.sort_index(axis=1)#按行的索引大小排序

    1   2  3   4
c  11  12  9  10
b   7   8  5   6
a   3   4  1   2

In [25]:
df4.sort_values(by=2)#按照列索引是2 的列的值进行排序

    2   1   4  3
a   4   3   2  1
b   8   7   6  5
c  12  11  10  9

# pandas选择数据

In [26]:
dates = pd.date_range('20170101',periods=6)
df1 = pd.DataFrame(np.arange(24).reshape(6,4),index=dates,columns=['a','b','c','d'])
df1

             a   b   c   d
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

通过索引取数据

In [27]:
df1['a']

2017-01-01     0
2017-01-02     4
2017-01-03     8
2017-01-04    12
2017-01-05    16
2017-01-06    20
Freq: D, Name: a, dtype: int32

In [28]:
df1.a

2017-01-01     0
2017-01-02     4
2017-01-03     8
2017-01-04    12
2017-01-05    16
2017-01-06    20
Freq: D, Name: a, dtype: int32

In [29]:
df1[['a','b']]

             a   b
2017-01-01   0   1
2017-01-02   4   5
2017-01-03   8   9
2017-01-04  12  13
2017-01-05  16  17
2017-01-06  20  21

In [30]:
df1[0:2]

            a  b  c  d
2017-01-01  0  1  2  3
2017-01-02  4  5  6  7

In [31]:
df1['20170101':'20170103']

            a  b   c   d
2017-01-01  0  1   2   3
2017-01-02  4  5   6   7
2017-01-03  8  9  10  11

通过标签取数据

In [32]:
df1.loc['20170101']

a    0
b    1
c    2
d    3
Name: 2017-01-01 00:00:00, dtype: int32

In [33]:
df1.loc['20170101',['a','c']]

a    0
c    2
Name: 2017-01-01 00:00:00, dtype: int32

In [34]:
df1.loc[:,['a','b']]

             a   b
2017-01-01   0   1
2017-01-02   4   5
2017-01-03   8   9
2017-01-04  12  13
2017-01-05  16  17
2017-01-06  20  21

In [35]:
df1.loc['20170101':'20170103',['a','b']]

            a  b
2017-01-01  0  1
2017-01-02  4  5
2017-01-03  8  9

通过为止选择数据

In [36]:
df1.iloc[2]

a     8
b     9
c    10
d    11
Name: 2017-01-03 00:00:00, dtype: int32

提取连续的行和列

In [37]:
df1.iloc[1:3,1:4]

            b   c   d
2017-01-02  5   6   7
2017-01-03  9  10  11

提取不连续的行和列

In [38]:
df1.iloc[[1,3],[2,3]]

             c   d
2017-01-02   6   7
2017-01-04  14  15

混合标签和位置选择

In [39]:
df1.ix[2:4,['a','c']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

             a   c
2017-01-03   8  10
2017-01-04  12  14

In [40]:
df1.ix['20170101':'20170103',2:4]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

             c   d
2017-01-01   2   3
2017-01-02   6   7
2017-01-03  10  11

In [41]:
df1.a

2017-01-01     0
2017-01-02     4
2017-01-03     8
2017-01-04    12
2017-01-05    16
2017-01-06    20
Freq: D, Name: a, dtype: int32

In [42]:
df1.a>6

2017-01-01    False
2017-01-02    False
2017-01-03     True
2017-01-04     True
2017-01-05     True
2017-01-06     True
Freq: D, Name: a, dtype: bool

In [43]:
df1[df1.a>6]

             a   b   c   d
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

# 赋值以及操作

In [44]:
# dates = pd.date_range('20190101',periods=6)
dates = np.arange(20190101,20190107)
df2 = pd.DataFrame(np.arange(24).reshape(6,4),index=dates,columns=['a','b','c','d'])
df2

           a   b   c   d
20190101   0   1   2   3
20190102   4   5   6   7
20190103   8   9  10  11
20190104  12  13  14  15
20190105  16  17  18  19
20190106  20  21  22  23

In [45]:
df2.iloc[2,2]=100
df2

           a   b    c   d
20190101   0   1    2   3
20190102   4   5    6   7
20190103   8   9  100  11
20190104  12  13   14  15
20190105  16  17   18  19
20190106  20  21   22  23

In [46]:
df2.loc[20190103,'c']=200
df2

           a   b    c   d
20190101   0   1    2   3
20190102   4   5    6   7
20190103   8   9  200  11
20190104  12  13   14  15
20190105  16  17   18  19
20190106  20  21   22  23

In [47]:
df2[df2.a>10]=10
df2

           a   b    c   d
20190101   0   1    2   3
20190102   4   5    6   7
20190103   8   9  200  11
20190104  10  10   10  10
20190105  10  10   10  10
20190106  10  10   10  10

In [48]:
df2.a[df2.a==10]=1
df2

          a   b    c   d
20190101  0   1    2   3
20190102  4   5    6   7
20190103  8   9  200  11
20190104  1  10   10  10
20190105  1  10   10  10
20190106  1  10   10  10

添加一列

In [49]:
df2['e']=10
df2

          a   b    c   d   e
20190101  0   1    2   3  10
20190102  4   5    6   7  10
20190103  8   9  200  11  10
20190104  1  10   10  10  10
20190105  1  10   10  10  10
20190106  1  10   10  10  10

In [50]:
df2['f'] = pd.Series([1,2,3,4,5,6],index=dates)
df2

          a   b    c   d   e  f
20190101  0   1    2   3  10  1
20190102  4   5    6   7  10  2
20190103  8   9  200  11  10  3
20190104  1  10   10  10  10  4
20190105  1  10   10  10  10  5
20190106  1  10   10  10  10  6

添加一行

In [51]:
df2.loc[20190107,['a','b','c','d','e']]=[1,2,3,4,5]
df2

            a     b      c     d     e    f
20190101  0.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN

In [52]:
s1 = pd.Series([1,2,3,4,5,6],index = ['a','b','c','d','e','f'])
s1.name='S1'
df3 = df2.append(s1)
df3

            a     b      c     d     e    f
20190101  0.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN
S1        1.0   2.0    3.0   4.0   5.0  6.0

插入一列

In [53]:
df2.insert(1,'g',df2['e'])
df2

            a     g     b      c     d     e    f
20190101  0.0  10.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0  10.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0  10.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   5.0   2.0    3.0   4.0   5.0  NaN

改变列的位置（插入，弹出）

In [54]:
g = df2.pop('g')
df2.insert(6,'g',g)
df2

            a     b      c     d     e    f     g
20190101  0.0   1.0    2.0   3.0  10.0  1.0  10.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0  10.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0  10.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0  10.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0  10.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0  10.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN   5.0

删除列

In [56]:
del df2['g']
df2

            a     b      c     d     e    f
20190101  0.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN

In [60]:
df1 = df2.drop(['a','b'],axis=1)
print(df1)
print(df2)

              c     d     e    f
20190101    2.0   3.0  10.0  1.0
20190102    6.0   7.0  10.0  2.0
20190103  200.0  11.0  10.0  3.0
20190104   10.0  10.0  10.0  4.0
20190105   10.0  10.0  10.0  5.0
20190106   10.0  10.0  10.0  6.0
20190107    3.0   4.0   5.0  NaN
            a     b      c     d     e    f
20190101  0.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN

In [61]:
df1 = df2.drop([20190101,20190105],axis=0)
print(df1)
print(df2)

            a     b      c     d     e    f
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN
            a     b      c     d     e    f
20190101  0.0   1.0    2.0   3.0  10.0  1.0
20190102  4.0   5.0    6.0   7.0  10.0  2.0
20190103  8.0   9.0  200.0  11.0  10.0  3.0
20190104  1.0  10.0   10.0  10.0  10.0  4.0
20190105  1.0  10.0   10.0  10.0  10.0  5.0
20190106  1.0  10.0   10.0  10.0  10.0  6.0
20190107  1.0   2.0    3.0   4.0   5.0  NaN

# 处理丢失数据

In [64]:
dates = np.arange(20190101,20190105)
df1 = pd.DataFrame(np.arange(12).reshape((4,3)),index=dates,columns=['a','b','c'])
df1

          a   b   c
20190101  0   1   2
20190102  3   4   5
20190103  6   7   8
20190104  9  10  11

In [65]:
df2 = pd.DataFrame(df1,index=dates,columns=['a','b','c','d','e'])
df2

          a   b   c   d   e
20190101  0   1   2 NaN NaN
20190102  3   4   5 NaN NaN
20190103  6   7   8 NaN NaN
20190104  9  10  11 NaN NaN

In [67]:
s1 = pd.Series([3,4,6],index=dates[:3])
s2 = pd.Series([32,5,2],index=dates[1:])
df2['d']=s1
df2['e']=s2
df2

          a   b   c    d     e
20190101  0   1   2  3.0   NaN
20190102  3   4   5  4.0  32.0
20190103  6   7   8  6.0   5.0
20190104  9  10  11  NaN   2.0

删除nan

In [71]:
df3 = df2.dropna(axis=0,how='any')
df3

          a  b  c    d     e
20190102  3  4  5  4.0  32.0
20190103  6  7  8  6.0   5.0

In [72]:
df3 = df2.dropna(axis=1,how='any')
df3

          a   b   c
20190101  0   1   2
20190102  3   4   5
20190103  6   7   8
20190104  9  10  11

填补nan

In [74]:
df3 = df2.fillna(value=0)
df3

          a   b   c    d     e
20190101  0   1   2  3.0   0.0
20190102  3   4   5  4.0  32.0
20190103  6   7   8  6.0   5.0
20190104  9  10  11  0.0   2.0

查看空值

In [75]:
df2.isnull()

              a      b      c      d      e
20190101  False  False  False  False   True
20190102  False  False  False  False  False
20190103  False  False  False  False  False
20190104  False  False  False   True  False

In [79]:
np.any(df2.isnull())

True

In [80]:
np.all(df2.isnull())

False

# 读取写入文件

In [83]:
file = pd.read_csv('testpandasdata/people.csv',encoding='gbk')
file

    地点  姓名  职位    工资 在职情况
0   北京  小a  专员  8000   在职
1   北京  小b  专员  8001   在职
2   北京   c  专员  8002   离职
3   北京   d  专员  8003   在职
4   北京   e  专员  8004   离职
5   上海   f  专员  8005   在职
6   上海   g  专员  8006   离职
7   上海   h  经理  8007   离职
8   上海   i  经理  8008   在职
9   上海   j  团长  8009   离职
10  上海   k  团长  8010   离职
11  广州   l  团长  8011   离职
12  广州   m  团长  8012   离职

In [84]:
file.iloc[2,0]='深圳'
file

    地点  姓名  职位    工资 在职情况
0   北京  小a  专员  8000   在职
1   北京  小b  专员  8001   在职
2   深圳   c  专员  8002   离职
3   北京   d  专员  8003   在职
4   北京   e  专员  8004   离职
5   上海   f  专员  8005   在职
6   上海   g  专员  8006   离职
7   上海   h  经理  8007   离职
8   上海   i  经理  8008   在职
9   上海   j  团长  8009   离职
10  上海   k  团长  8010   离职
11  广州   l  团长  8011   离职
12  广州   m  团长  8012   离职

In [85]:
file.to_csv('testpandasdata/people2.csv')

# 数据合并

In [86]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'])
df2 = pd.DataFrame(np.arange(12,24).reshape(3,4),columns=['a','b','c','d'])
df3 = pd.DataFrame(np.arange(24,36).reshape(3,4),columns=['a','b','c','d'])
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [87]:
df2

    a   b   c   d
0  12  13  14  15
1  16  17  18  19
2  20  21  22  23

In [88]:
df3

    a   b   c   d
0  24  25  26  27
1  28  29  30  31
2  32  33  34  35

In [ ]:
df4 = pd.concat()